<a href="https://colab.research.google.com/github/Suryaprakash17/letsupgrade-DS-advance/blob/main/Day10(Q1).ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

**Q1:**

In [39]:
import pandas as pd #import and version(1)
import numpy as np
pd.__version__

'1.1.5'

In [ ]:
number=pd.Series([2,4,5,8],index=['A','B','C','D'])
number

A    2
B    4
C    5
D    8
dtype: int64

In [ ]:
df=pd.DataFrame(number,columns=['Numbers'])
df

   Numbers
A        2
B        4
C        5
D        8

In [ ]:
df.index

Index(['A', 'B', 'C', 'D'], dtype='object')

In [ ]:
df1=df.reset_index()
df1

  index  Numbers
0     A        2
1     B        4
2     C        5
3     D        8

In [ ]:
df1.columns

Index(['index', 'Numbers'], dtype='object')

In [ ]:
df1.index

RangeIndex(start=0, stop=4, step=1)

In [ ]:
df1

  index  Numbers
0     A        2
1     B        4
2     C        5
3     D        8

In [ ]:
df1.columns=['Alphabet','Numbers'] #convert series to columns(2)
df1

  Alphabet  Numbers
0        A        2
1        B        4
2        C        5
3        D        8

In [ ]:
ts=pd.Series(['Surya','Ajay','Gautham'],name='Name') # Combine many series to form a dataframe
ts1=pd.Series([19,18,20],name='Age')
print(ts)
print(ts1)
print()
s=pd.merge(ts,ts1,left_index=True,right_index=True)
s

0      Surya
1       Ajay
2    Gautham
Name: Name, dtype: object
0    19
1    18
2    20
Name: Age, dtype: int64

      Name  Age
0    Surya   19
1     Ajay   18
2  Gautham   20

In [ ]:
#Assign a name to the series, index(4)
s=pd.Series([12,34,56,78,90])
_index_=['Surya','Gowtham','karthick','Rishi','Madhan'] 
s.index=_index_
print(s)

Surya       12
Gowtham     34
karthick    56
Rishi       78
Madhan      90
dtype: int64

In [ ]:
num_state = np.random.RandomState(100) #get the minimum, 25th percentile, median, 75th, and max of a numeric series(5)
num_series = pd.Series(num_state.normal(10, 4, 20))
print("Original Series:")
print(num_series)
result = np.percentile(num_series, q=[0, 25, 50, 75, 100])
print("\nMinimum, 25th percentile, median, 75th, and maximum of a num series:")
print(result)

Original Series:
0      3.000938
1     11.370722
2     14.612143
3      8.990256
4     13.925283
5     12.056875
6     10.884719
7      5.719827
8      9.242017
9     11.020006
10     8.167892
11    11.740654
12     7.665620
13    13.267388
14    12.690883
15     9.582355
16     7.874878
17    14.118931
18     8.247458
19     5.526727
dtype: float64

Minimum, 25th percentile, median, 75th, and maximum of a num series:
[ 3.00093811  8.09463867 10.23353705 12.21537733 14.61214321]

In [43]:
from google.colab import files
uploaded=files.upload()

Saving students_record.csv to students_record (3).csv

In [44]:
for fn in uploaded.keys():
  print('User uploaded file "{name}" with length {length} bytes'.format(
      name=fn, length=len(uploaded[fn])))

User uploaded file "students_record.csv" with length 221 bytes

In [45]:
uploaded

{'students_record.csv': b'Name,OverallGrade,Obedient,ResearchScore,ProjectScore,Recommend\nHenry,A,Y,90,85,Yes\nJohn,C,N,85,51,Yes\nDavid,F,N,10,17,No\nHolmes,B,Y,75,71,No\nMarvin,E,N,20,30,No\nSimon,A,Y,92,79,Yes\nRobert,B,Y,60,59,No\nTrent,C,Y,75,33,No\n'}

In [46]:
import io
df = pd.read_csv(io.StringIO(uploaded['students_record.csv'].decode('utf-8')))
df.head()

     Name OverallGrade Obedient  ResearchScore  ProjectScore Recommend
0   Henry            A        Y             90            85       Yes
1    John            C        N             85            51       Yes
2   David            F        N             10            17        No
3  Holmes            B        Y             75            71        No
4  Marvin            E        N             20            30        No

In [47]:
df

     Name OverallGrade Obedient  ResearchScore  ProjectScore Recommend
0   Henry            A        Y             90            85       Yes
1    John            C        N             85            51       Yes
2   David            F        N             10            17        No
3  Holmes            B        Y             75            71        No
4  Marvin            E        N             20            30        No
5   Simon            A        Y             92            79       Yes
6  Robert            B        Y             60            59        No
7   Trent            C        Y             75            33        No

**qcut**

**The pandas documentation describes qcut as a “Quantile-based discretization function.” This basically means that qcut tries to divide up the underlying data into equal sized bins. The function defines the bins using percentiles based on the distribution of the data, not the actual numeric edges of the bins.**

In [48]:
pd.cut(df['ProjectScore'],bins=3).value_counts()  #qcut() in pandas(6)

(62.333, 85.0]      3
(16.932, 39.667]    3
(39.667, 62.333]    2
Name: ProjectScore, dtype: int64

In [49]:
num_series = pd.Series(np.random.randint(1,10,9))
print("Original Series:") #positions of numbers that are multiples of 3 from a series(7)
print(num_series)
arr=np.array(num_series)
result = np.argwhere(arr %3==0)
print("Positions of numbers that are multiples of 3:")
print(result)

Original Series:
0    1
1    9
2    4
3    3
4    9
5    2
6    6
7    9
8    2
dtype: int64
Positions of numbers that are multiples of 3:
[[1]
 [3]
 [4]
 [6]
 [7]]

In [50]:
#How to stack two series vertically and horizontally (8)   (vertical)
s1=pd.Series(['A','B','C','D','E'],name='Alphabet')
s2=pd.Series(['1','2','3','4','5'],name='Numbers')
print(s1)                                       
print(s2)                                           
con=pd.concat([s1,s2],axis=0)
print(con)

0    A
1    B
2    C
3    D
4    E
Name: Alphabet, dtype: object
0    1
1    2
2    3
3    4
4    5
Name: Numbers, dtype: object
0    A
1    B
2    C
3    D
4    E
0    1
1    2
2    3
3    4
4    5
dtype: object

In [51]:
s1=pd.Series(['A','B','C','D','E'],name='Alphabet')   #(Horizontal)
s2=pd.Series(['1','2','3','4','5'],name='Numbers')
print(s1)                                      
print(s2)                                           
con=pd.concat([s1,s2],axis=1)
print(con)

0    A
1    B
2    C
3    D
4    E
Name: Alphabet, dtype: object
0    1
1    2
2    3
3    4
4    5
Name: Numbers, dtype: object
  Alphabet Numbers
0        A       1
1        B       2
2        C       3
3        D       4
4        E       5

In [52]:
#How to get the day of month, week number, day of year and day of week from a series of date strings(9)
from dateutil.parser import parse
date_series = pd.Series(['01 Jan 2015', '10-02-2016', '20180307', '2014/05/06', '2016-04-12', '2019-04-06T11:20'])
print("Original Series:")
print(date_series)
print()
date_series = date_series.map(lambda x: parse(x))
print("Day of month:")
print(date_series.dt.day.tolist())
print()
print("Day of year:")
print(date_series.dt.dayofyear.tolist())
print()
print("Week number:")
print(date_series.dt.weekofyear.tolist())
print()
print("Day of week:")
print(date_series.dt.dayofweek.tolist())

Original Series:
0         01 Jan 2015
1          10-02-2016
2            20180307
3          2014/05/06
4          2016-04-12
5    2019-04-06T11:20
dtype: object

Day of month:
[1, 2, 7, 6, 12, 6]

Day of year:
[1, 276, 66, 126, 103, 96]

Week number:
[1, 39, 10, 19, 15, 14]

Day of week:
[3, 6, 2, 1, 1, 5]

/usr/local/lib/python3.6/dist-packages/ipykernel_launcher.py:15: FutureWarning: Series.dt.weekofyear and Series.dt.week have been deprecated.  Please use Series.dt.isocalendar().week instead.
  from ipykernel import kernelapp as app

In [53]:
#Compute the euclidean distance between two series(10)
x = pd.Series([1, 2, 3, 4, 5]) 
y = pd.Series([6, 7, 8, 9, 10])    
p = np.sum([(a * a) for a in x]) 
p1 = np.sum([(b * b) for b in y]) 
p2 = -1 * np.sum([(2 * a*b) for (a, b) in zip(x, y)]) 
d = np.sqrt(np.sum(p + p1 + p2)) 
print("Series 1 is", x) 
print("Series 2 is", y) 
print("Euclidean distance between two series is:", d)

Series 1 is 0    1
1    2
2    3
3    4
4    5
dtype: int64
Series 2 is 0     6
1     7
2     8
3     9
4    10
dtype: int64
Euclidean distance between two series is: 11.180339887498949

In [54]:
#Apply function on existing columns(11)
matrix = [(1, 2, 3), 
          (4, 5, 6), 
          (7, 8, 9)] 
df = pd.DataFrame(matrix, columns = ['x','y','z'],index = ['a','b','c']) 
new_df = df.apply(lambda x: np.square(x) if x.name == 'z' else x) 
new_df

   x  y   z
a  1  2   9
b  4  5  36
c  7  8  81